---
kind: method
id: M:Autodesk.Revit.DB.Mullion.JoinMullion
source: html/810da4fa-f2aa-6db4-c72c-e2d58dda1999.htm
---
# Autodesk.Revit.DB.Mullion.JoinMullion Method

This method is used to control the join condition the current Mullion with its neighboring mullions.

## Syntax (C#)
```csharp
public void JoinMullion()
```

## Remarks
The mullions being perpendicular to it will be broken accordingly.